{
    "cvContent": "Lars Tischer\nAddress: Muehlenweg 19, 21481 Lauenburg, Germany\nEmail: larstischer@icloud.com\nPhone: +49 157 35 19 24 96\nLinkedIn: https://www.linkedin.com/in/lars-tischer-5b9b13317/\n\nProfessional Summary\nSenior Project Manager with 7 years of experience, accountable as Quality Authority within the software development process for medical technology software. Leading decentralized, cross-functional teams, managing complex projects with more than 1400 software requirements. Driving continuous improvement initiatives such as the setup of a modernst test laboratory to always assure quality relevant evidence before project deadlines.\nAdept at strategic planning for design verifications, requirement -and test management, regulated product documentation according to the V-model and agile development. Fostering collaboration to achieve organizational goals in alignment with individual's purpose. Sincere people empowerer, communicator and persuader by nature.\n\nProfessional Experience\nQuality Test Manager, System Integration OLYMPUS Surgical Technologies Europe, Hamburg, Germany 04/2019 – 04/2024\nKey Responsibilities:\n- Led design verification projects, overseeing a team of 4 core members plus externals.\n- Managed the end-to-end software development process for medical technology.\n- Strategically planned and directed all test activities.\n- Developed comprehensive test specifications, plans, and documentation.\n- Implemented a state-of-the-art test lab, enhancing testing capabilities.\n- Conducted usability engineering (UX), requirements engineering and management.\n- Fostered a collaborative team environment, resulting in successful project completions.\n\nQuality Test Engineer, System Integration OLYMPUS Surgical Technologies Europe, Hamburg, Germany 08/2017 - 03/2019\nKey Responsibilities:\n- Engineered tests for medical products following the V-Model.\n- Produced detailed technical documentation and test cases.\n- Conducted verification activities and facilitated project reviews.\n- Collaborated with cross-functional teams to ensure project success.\n\nWorking student, Product Quality OLYMPUS Surgical Technologies Europe, Hamburg, Germany 02/2017 - 07/2017\nKey Responsibilities:\n- Supported the Product Quality department in developing test procedures.\n- Conducted hardware and software tests and documented findings.\n\nService Technician YXLON International GmbH, Hamburg, Germany 01/2014 - 09/2015\nKey Responsibilities:\n- Led global customer deployments and system installations e.g. for automotive industries.\n- Conducted customer training sessions and created comprehensive documentation.\n\nCommissioning Engineer / Construction Manager for Biogas Plants Elektrotechnik Frank Günther GmbH & Co. KG, Schwarzenbek, Germany 02/2010 - 01/2012\nKey Responsibilities:\n- Led the installation and commissioning of biogas plants.\n- Managed special machine construction and planning services.\n\nElectrician for Energy and Building Technology Elektro Schönbrodt GmbH, Reinbek, Germany 09/2009 - 01/2010\nResponsibilities:\n- Conducted special machine construction and industrial services.\n\nElectrician for Energy and Building Technology NORMAN el, Vejen, Denmark 02/2008 - 02/2009\nKey Responsibilities:\n- Managed the construction of a 42-unit residential complex.\n\nEducation\nMaster of Science in Electrical and Electronic Engineering Glyndwr University, Wrexham, United Kingdom 05/2016 - 07/2017\n\nBachelor of Engineering in Electrical and Electronic Engineering Glyndwr University, Wrexham, United Kingdom 09/2015 - 05/2016\n\nSummerschool in Electrical and Electronic Engineering Glyndwr University, Wrexham, United Kingdom 08/2015 - 09/2015\n\nState-Certified Electrical Technician State Technical School for Energy Technology G10, Hamburg, Germany 02/2012 - 01/2014\n\nApprenticeship in Electrical Engineering for Energy and Building Technology Elektro Lange GmbH, Geesthacht, Germany 08/2004 - 01/2008\n\nSecondary School Diploma Albinus Secondary School, Lauenburg, Germany 08/1999 - 06/2004\n\nSkills and Certifications\nLeadership Skills:\n- Team management\n- Strategic planning\n- Decision-making\n- Project management\n\nCertifications:\n- ISTQB Test Manager – Advanced Level\n- IREB Certified Professional for Requirements Engineering & Requirements Management (Advanced Level)\n- Certified Professional for Usability and User Experience – Foundation Level\n- Advanced Project management\n- ISTQB Certified Tester – Foundation Level\n- Basic – Qualification Project management\n\nTechnical Knowledge:\n- ISO 9000ff., ISO 13485, FDA-QSR, IEC 62304, IEC 60601-1,3\n- Medical electrical equipment safety courses\n- Power electronics, process and automation technology\n- Measurement and control technology, drive technology\n- Maintenance analysis and management\n- Academic English\n- Documentation practices\n\nLanguages:\n- German: Native\n- English: Fluent (C1 level in spoken and written)\n\nPassion:\n- Jesus (It's better to depend on the LORD)\n- Human beings and being human\n- Technology\n- Music (vibrance)\n- Audio (frequency)\n- Writing\n- Drawing\n- Cars\n- Cycling (instagram: @workbikebalance_)\n\nPersonal Details\nDate of Birth: 29.01.1988\nPlace of Birth: Reinbek\nMarital Status: Single\nNationality: German\n\nReferences\nAvailable upon request."
} 